In [17]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt

In [21]:
data=pd.read_csv("C:/Users/hp/Downloads/Mall_Customers(3).xls")

In [23]:
data.head()

   CustomerID  Gender  Age  Annual Income (k$)  Spending Score (1-100)
0           1    Male   19                  15                      39
1           2    Male   21                  15                      81
2           3  Female   20                  16                       6
3           4  Female   23                  16                      77
4           5  Female   31                  17                      40

In [25]:
data[['Gender','Age']].head()

   Gender  Age
0    Male   19
1    Male   21
2  Female   20
3  Female   23
4  Female   31

In [27]:
data.tail()

     CustomerID  Gender  Age  Annual Income (k$)  Spending Score (1-100)
195         196  Female   35                 120                      79
196         197  Female   45                 126                      28
197         198    Male   32                 126                      74
198         199    Male   32                 137                      18
199         200    Male   30                 137                      83

In [29]:
data.sample(5)

     CustomerID  Gender  Age  Annual Income (k$)  Spending Score (1-100)
57           58    Male   69                  44                      46
112         113  Female   38                  64                      42
98           99    Male   48                  61                      42
16           17  Female   35                  21                      35
134         135    Male   20                  73                       5

In [31]:
data.sample(frac=0.1)

     CustomerID  Gender  Age  Annual Income (k$)  Spending Score (1-100)
109         110    Male   66                  63                      48
108         109    Male   68                  63                      43
50           51  Female   49                  42                      52
89           90  Female   50                  58                      46
83           84  Female   46                  54                      44
23           24    Male   31                  25                      73
120         121    Male   27                  67                      56
67           68  Female   68                  48                      48
197         198    Male   32                 126                      74
184         185  Female   41                  99                      39
174         175  Female   52                  88                      13
152         153  Female   44                  78                      20
39           40  Female   20                  37                      75
17           18    Male   20                  21                      66
149         150    Male   34                  78                      90
22           23  Female   46                  25                       5
71           72  Female   47                  49                      42
101         102  Female   49                  62                      48
132         133  Female   25                  72                      34
53           54    Male   59                  43                      60

In [33]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 5 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   CustomerID              200 non-null    int64
 1   Gender                  200 non-null    object
 2   Age                     200 non-null    int64
 3   Annual Income (k$)      200 non-null    int64
 4   Spending Score (1-100)  200 non-null    int64
dtypes: int64(4), object(1)
memory usage: 7.9+ KB

In [35]:
data.describe()

       CustomerID         Age  Annual Income (k$)  Spending Score (1-100)
count  200.000000  200.000000          200.000000              200.000000
mean   100.500000   38.850000           60.560000               50.200000
std     57.879185   13.969007           26.264721               25.823522
min      1.000000   18.000000           15.000000                1.000000
25%     50.750000   28.750000           41.500000               34.750000
50%    100.500000   36.000000           61.500000               50.000000
75%    150.250000   49.000000           78.000000               73.000000
max    200.000000   70.000000          137.000000               99.000000

In [37]:
data.dtypes

CustomerID                 int64
Gender                    object
Age                        int64
Annual Income (k$)         int64
Spending Score (1-100)     int64
dtype: object

In [39]:
data.columns

Index(['CustomerID', 'Gender', 'Age', 'Annual Income (k$)', 'Spending Score (1-100)'], dtype='object')

In [41]:
data.rename(columns={'Annual Income (k$)':'AnnualIncome','Spending Score (1-100)':'SpendingScore'},inplace=True)

In [43]:
for i,col in enumerate(data.columns):
    print((i+1),'. columns is :',col)

1 . columns is : CustomerID
2 . columns is : Gender
3 . columns is : Age
4 . columns is : AnnualIncome
5 . columns is : SpendingScore

In [45]:
data.shape

(200, 5)

In [47]:
data.isnull().sum()

CustomerID       0
Gender           0
Age              0
AnnualIncome     0
SpendingScore    0
dtype: int64

In [49]:
print(list(data.isnull().any()))

[False, False, False, False, False]

In [51]:
data.isnull().values.any()

False

In [53]:
data.dtypes

CustomerID        int64
Gender           object
Age               int64
AnnualIncome      int64
SpendingScore     int64
dtype: object